Repository: Bachar-official/flutter_qso
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Profile
ru: Профиль

source: Log
ru: Журнал

source: Language
ru: Язык

source: Dark
ru: Тёмная

source: Light
ru: Светлая

source: Theme
ru: Тема

# newQso
source: New record to log
ru: Новая запись в журнал

# emptyField
source: Field must be filled
ru: Поле должно быть заполнено

source: Add
ru: Добавить

# operator
source: Your callsign
ru: Ваш позывной

# call
source: Subscriber's callsign
ru: Позывной абонента

# qsoDate
source: Date and time of QSO
ru: Дата и время QSO

# mode
source: Modulation
ru: Модуляция

# rstSent
source: Sent report
ru: Исходящий рапорт

# rstRcvd
source: Received report
ru: Входящий рапорт

source: Band
ru: Диапазон

# qth
source: Subscriber's QTH
ru: QTH абонента

source: Comment
ru: Комментарий

source: Strength
ru: Громкость

source: Readability
ru: Разборчивость

source: Tone
ru: Тон

# strengthReq
source: Second digit from 1 to 9
ru: Значение второго числа от 1 до 9

# readabilityReq
source: First digit from 1 to 5
ru: Значение первого числа от 1 до 5

# toneReq
source: Third digit from 1 to 9
ru: Значение третьего числа от 1 до 9

# onlyDigit
source: Field can only contain a two- or three-digit number
ru: В поле может быть двузначное или трёхзначное число

# r_s
source: Readability, Strength and/or Tone
ru: Разборчивость, громкость и (или) тон

# getCurrentDate
source: Get current date and time
ru: Взять текущие дату и время

source: Unknown
ru: Неизвестно

# name
source: Subscriber's name
ru: Имя абонента

source: Cancel
ru: Отмена

source: Save
ru: Сохранить

source: Default mode
ru: Модуляция по умолчанию

source: Default band
ru: Диапазон по умолчанию

# delete_qso_confirmation
source: Are you sure you want to delete this QSO?
ru: Вы уверены, что хотите удалить это QSO?

source: Yes
ru: Да

source: No
ru: Нет

# clear_qso_confirmation
source: This action will clear all QSOs. Are you sure?
ru: Это действие удалит все QSO. Вы уверены?

# no_qsos
source: No log entries found. Click "+" to create a new one.
ru: Записей в журнале не найдено. Нажмите "+", чтобы создать новую.

# query
source: Search query
ru: Поисковый запрос

# delete_all
source: Delete all QSOs
ru: Удалить все QSO

# export
source: Export QSOs
ru: Экспорт QSO

# saveAs
source: Save QSO as...
ru: Сохранить QSO как...

# minCallsignLength
source: Minimum field length is 3 symbols
ru: Минимальная длина поля 3 символа

# maxCallsignLength
source: Maximum field length is 15 symbols
ru: Максимальная длина поля 15 символов

source: Wrong format
ru: Неправильный формат
